mac-setup-monterey-m1.html
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="utf-8">
    <title>borborygmi</title>
    <meta name="description" content="">
    <meta name="author" content="Noah Hoffman">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le styles -->
    <link href="https://nhoffman.github.io/borborygmi/theme/bootstrap.min.css" rel="stylesheet">
    <link href="https://nhoffman.github.io/borborygmi/theme/bootstrap.min.responsive.css" rel="stylesheet">
    <link href="https://nhoffman.github.io/borborygmi/theme/local.css" rel="stylesheet">
    <link href="https://nhoffman.github.io/borborygmi/theme/pygments.css" rel="stylesheet">

</head>

<body>

<div class="navbar">
    <div class="navbar-inner">
    <div class="container">

         <a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
             <span class="icon-bar"></span>
             <span class="icon-bar"></span>
             <span class="icon-bar"></span>
         </a>

        <a class="brand" href="https://nhoffman.github.io/borborygmi">borborygmi</a>

        <div class="nav-collapse">
        <ul class="nav">

        </ul>
        </div>

    </div>
    </div>
</div>

<div class="container">
    <div class="content">
    <div class="row">

        <div class="span9">
  <div class='article'>
    <div class="content-title">
      <h1>Mac M1 Monterey setup</h1>
Sat 23 July 2022 &#8212;


<em>Filed under <a href="https://nhoffman.github.io/borborygmi/category/notes.html">notes</a>;
    tags: <a href="https://nhoffman.github.io/borborygmi/tag/mac.html">mac</a></em>    </div>

    <div><div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7a641eb">system update</a></li>
<li><a href="#orgb61c103">Developer tools</a></li>
<li><a href="#org71f734c">system settings</a>
<ul>
<li><a href="#orgbda06b5">turn off spelling autocorrect</a></li>
<li><a href="#org821df5c">unmap Control + left,right</a></li>
<li><a href="#orge498185">Turn on FileVault</a></li>
</ul>
</li>
<li><a href="#org1cd8ccb">homebrew</a>
<ul>
<li><a href="#org5f0ba5d">CLI applications</a></li>
<li><a href="#org70150da">desktop applications</a></li>
</ul>
</li>
<li><a href="#org650b9f3">iTerm2</a></li>
<li><a href="#orgfddcc21">zsh</a></li>
<li><a href="#org6b58fbe">python</a>
<ul>
<li><a href="#orga45f544">pyvenv</a></li>
<li><a href="#org2239c0e">pipx</a></li>
</ul>
</li>
<li><a href="#org02dc3b3">emacs</a></li>
<li><a href="#org108c261">R</a></li>
<li><a href="#orge72233d">postgresql</a></li>
</ul>
</div>
</div>
<p>
Yet another installation of my personal notes for setting up a new (or
cleanly installed) MacOS computer. The process changes just a bit with
each new OS version. I will try really hard to reproduce the steps in
an order that make then easiest to execute.
</p>

<p>
This was not a re-installation (new laptop!), so no need to jump through the
hoops of downloading an installer, etc. Note that none of the steps below
require an Apple ID - I held off on signing in until the very end just to see if
it was possible.
</p>

<p>
I do copy some things over from my previous computer, but it's pretty
minimal. Here's the command to gather up what I need to transfer.
</p>

<pre class="example">
tar -cf dotfiles.tar .gitconfig .gnupg .netrc .psqlrc .pypirc .ssh .aws .saml2aws .psqlrc .zprofile
</pre>


<p>
It's also handy to know all of the projects I'm working on:
</p>

<pre class="example">
cd ~/src
for dname in */.git; do git -C $(dirname $dname) remote -v; done &gt; remotes.txt
</pre>

<div id="outline-container-org7a641eb" class="outline-2">
<h2 id="org7a641eb">system update</h2>
<div class="outline-text-2" id="text-org7a641eb">
<p>
The first thing I did this time around was to perform a system software update
to get all of that waiting out of the way.
</p>
</div>
</div>

<div id="outline-container-orgb61c103" class="outline-2">
<h2 id="orgb61c103">Developer tools</h2>
<div class="outline-text-2" id="text-orgb61c103">
<p>
Also takes a while. This can be done from the command line:
</p>

<div class="org-src-container">
<pre class="src src-sh">xcode-select --install
</pre>
</div>
</div>
</div>

<div id="outline-container-org71f734c" class="outline-2">
<h2 id="org71f734c">system settings</h2>
<div class="outline-text-2" id="text-org71f734c">
</div>
<div id="outline-container-orgbda06b5" class="outline-3">
<h3 id="orgbda06b5">turn off spelling autocorrect</h3>
<div class="outline-text-3" id="text-orgbda06b5">
<pre class="example">
System Preferences --&gt; Keyboard --&gt; Text tab --&gt; unselect "Correct spelling automatically" and others
</pre>
</div>
</div>
<div id="outline-container-org821df5c" class="outline-3">
<h3 id="org821df5c">unmap Control + left,right</h3>
<div class="outline-text-3" id="text-org821df5c">
<p>
I use Control plus the left and right arrow keys to move between
windows in emacs and tmux, so I disable the defaults.
</p>

<pre class="example">
System Preferences --&gt; Keyboard --&gt; Shortcuts --&gt; uncheck mission control: move left/right a space
</pre>
</div>
</div>

<div id="outline-container-orge498185" class="outline-3">
<h3 id="orge498185">Turn on FileVault</h3>
<div class="outline-text-3" id="text-orge498185">
<pre class="example">
System Preferences --&gt; Security &amp; privacy --&gt; FileVault
</pre>


<p>
I used a recovery key option rather than iCloud for my work machine, iCloud for personal
</p>
</div>
</div>
</div>

<div id="outline-container-org1cd8ccb" class="outline-2">
<h2 id="org1cd8ccb">homebrew</h2>
<div class="outline-text-2" id="text-org1cd8ccb">
<p>
Still a one-liner, now bash rather than ruby:
</p>

<div class="org-src-container">
<pre class="src src-sh">/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
brew doctor
</pre>
</div>

<p>
Homebrew is installed to <code>/opt/local</code> on an M1 Mac. This required updating my PATH configuration. I added the following to my login profile:
</p>

<div class="org-src-container">
<pre class="src src-sh">if [[ -d /opt/homebrew ]]; then
    eval "$(/opt/homebrew/bin/brew shellenv)"
fi
</pre>
</div>

<p>
The new location required a number of changes to various login steps configuring
homebrew-installed components.
</p>
</div>

<div id="outline-container-org5f0ba5d" class="outline-3">
<h3 id="org5f0ba5d">CLI applications</h3>
<div class="outline-text-3" id="text-org5f0ba5d">
<p>
Many packages are installed later with additional elaboration or in as
dependencies for other applications; here are some more or less
standalone packages that I routinely install up front.
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install git &amp;&amp; \
brew install wget &amp;&amp; \
brew install autojump &amp;&amp; \
brew install gcc &amp;&amp; \
brew install graphviz &amp;&amp; \
brew install latex2rtf &amp;&amp; \
brew install mcfly &amp;&amp; \
brew install pandoc &amp;&amp; \
brew install pngpaste &amp;&amp; \
brew install tmux &amp;&amp; \
brew install tree &amp;&amp; \
brew install fd &amp;&amp; \
brew install xsv &amp;&amp; \
brew install fzf &amp;&amp; \
brew install saml2aws &amp;&amp; \
brew install jq &amp;&amp; \
brew install duckdb &amp;&amp; \
brew install fswatch &amp;&amp; \
brew install node
</pre>
</div>
</div>
</div>

<div id="outline-container-org70150da" class="outline-3">
<h3 id="org70150da">desktop applications</h3>
<div class="outline-text-3" id="text-org70150da">
<p>
Homebrew installs desktop apps too! (the syntax has changed a bit)
</p>

<div class="org-src-container">
<pre class="src src-sh">for pkg in dropbox sizeup dash google-chrome mactex iterm2; do brew install --cask $pkg; done
</pre>
</div>

<p>
Some of the above (eg, sizeup, dropbox, dash) require licenses and
credentials that must be installed interactively.
</p>
</div>
</div>
</div>

<div id="outline-container-org650b9f3" class="outline-2">
<h2 id="org650b9f3">iTerm2</h2>
<div class="outline-text-2" id="text-org650b9f3">
<p>
Install using homebrew above. Update a few settings.
</p>

<p>
Preferences &#x2013;&gt; Profiles &#x2013;&gt; Keys and do these things:
</p>
<ul class="org-ul">
<li>select "Left/right option key acts as": +Esc</li>
<li>+ &#x2013;&gt; Keyboard shortcut "OPT+&lt;left arrow&gt;": Send Escape sequence "b"</li>
<li>+ &#x2013;&gt; Keyboard shortcut "OPT+&lt;right arrow&gt;": Send Escape sequence "f"</li>
</ul>

<p>
(may have to delete or replace an existing mapping)
</p>

<p>
Default appearance:
</p>

<ul class="org-ul">
<li>Preferences &#x2013;&gt; Profiles &#x2013;&gt; Colors &#x2013;&gt; Color Presets &#x2013;&gt; Light Background</li>
<li>Preferences &#x2013;&gt; Profiles &#x2013;&gt; Text &#x2013;&gt; Change Font &#x2013;&gt; 14 point</li>
</ul>

<p>
Install shell integration:
</p>

<pre class="example">
curl -L https://iterm2.com/shell_integration/install_shell_integration.sh | bash
</pre>


<ul class="org-ul">
<li>Install python runtime by selecting "Scripts" &#x2013;&gt; "Manage" &#x2013;&gt; "Install Python Runtime".</li>
<li>Enable the Python API under "Preferences" &#x2013;&gt; "General" &#x2013;&gt; "Magic"</li>
</ul>
</div>
</div>

<div id="outline-container-orgfddcc21" class="outline-2">
<h2 id="orgfddcc21">zsh</h2>
<div class="outline-text-2" id="text-orgfddcc21">
<p>
zsh is the default shell on MacOS.
</p>

<p>
Install my dotfiles.
</p>

<div class="org-src-container">
<pre class="src src-sh">cd ~
git clone git@bitbucket.org:nhoffman/dotfiles.git
~/dotfiles/mac/install.py
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b58fbe" class="outline-2">
<h2 id="org6b58fbe">python</h2>
<div class="outline-text-2" id="text-org6b58fbe">
<p>
Monterey apparently provides Python 3.8.9 as <code>=/usr/bin/python3=</code> with no
<code>=python=</code> executable. I'm a little bit puzzled by this since my notes say that
Big Sur provided 3.9.5.
</p>
</div>

<div id="outline-container-orga45f544" class="outline-3">
<h3 id="orga45f544">pyvenv</h3>
<div class="outline-text-3" id="text-orga45f544">
<p>
My current method for managing python interpreters is to
use pyenv. See <a href="https://realpython.com/intro-to-pyenv/">https://realpython.com/intro-to-pyenv/</a>
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install zlib
brew install pyenv
brew install pyenv-virtualenv
</pre>
</div>

<p>
Install pyenv-update plugin:
</p>

<pre class="example">
git clone https://github.com/pyenv/pyenv-update.git $(pyenv root)/plugins/pyenv-update
</pre>


<p>
added dotfiles/mac/zsh/pyenv.plugin.zsh
</p>

<div class="org-src-container">
<pre class="src src-sh">if [[ -d "$HOME/.pyenv" ]]; then
    # echo "using pyenv"
    export PYENV_ROOT="$HOME/.pyenv"
    export PATH="$PYENV_ROOT/bin:$PATH"
    eval "$(pyenv init --path)"
fi
</pre>
</div>

<p>
Install the most recent versions of 3.8, 3.9 and 3.10 and set 3.10 as the default.
</p>

<div class="org-src-container">
<pre class="src src-sh">pyenv install $(pyenv install -l | grep '^  3.8' | tail -n1)
pyenv install $(pyenv install -l | grep '^  3.9' | tail -n1)
pyenv install $(pyenv install -l | grep '^  3.10' | tail -n1)
pyenv global $(pyenv install -l | grep '^  3.10' | tail -n1)
python3 -m pip install -U pip wheel
</pre>
</div>

<p>
pyenv seems not to install a <code>=python=</code> entrypoint. I'll see how it goes with
<code>=python3=</code> only.
</p>
</div>
</div>

<div id="outline-container-org2239c0e" class="outline-3">
<h3 id="org2239c0e">pipx</h3>
<div class="outline-text-3" id="text-org2239c0e">
<p>
I'm trying out <a href="https://github.com/pypa/pipx">pipx</a> for installing standalone python-language commands outside
of project-level virtual environments.
</p>

<p>
pipx recommends installation from homebrew, so that's what we'll go with:
</p>

<div class="org-src-container">
<pre class="src src-shell">brew install pipx
</pre>
</div>

<p>
The installation instructions include running <code>=pipx ensurepath=</code>, but this appears not to be necessary if <code>=~/.local/bin=</code> is already added to your PATH.
</p>

<p>
Install some globally useful packages:
</p>

<div class="org-src-container">
<pre class="src src-shell">pipx install awscli
pipx install pgcli
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org02dc3b3" class="outline-2">
<h2 id="org02dc3b3">emacs</h2>
<div class="outline-text-2" id="text-org02dc3b3">
<p>
This required a bit of a change. For a long time I have been installing binaries
from <a href="http://emacsformacosx.com/">http://emacsformacosx.com/</a>. This project provides universal binaries, and
the command line executables are found within the Emacs.app application bundle.
Unfortunately I ran into some errors in which magit seemed to load precompiled
code for the wrong architecture - this seemed like too much effort to figure out
given that there are alternatives out there. I wound up using the <a href="https://github.com/d12frosted/homebrew-emacs-plus">Homebrew
emacs-plus</a> project, which seems great so far.
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install libressl
brew install aspell
brew install gpg
brew tap d12frosted/emacs-plus
brew install emacs-plus
</pre>
</div>

<p>
Check out my .emacs.d and run setup scripts.
</p>

<div class="org-src-container">
<pre class="src src-sh">cd ~
git clone git@github.com:nhoffman/emacs-config.git .emacs.d
</pre>
</div>

<p>
Run setup scripts:
</p>

<div class="org-src-container">
<pre class="src src-sh">cd ~/.emacs.d
bin/python-setup.sh
</pre>
</div>

<p>
The main inconvenience was having to adapt my startup script to juggle M1 Mac,
x86 Mac, and linux:
</p>

<div class="org-src-container">
<pre class="src src-sh">if [[ $(uname) == 'Darwin' ]]; then
    if [[ $(uname -m) == 'arm64' ]]; then
	# assume we are using emacs-plus
	EMACS=/opt/homebrew/bin/emacs
	EMACS_BIN=/opt/homebrew/bin/emacsclient
    else
	EMACS=/Applications/Emacs.app/Contents/MacOS/Emacs
	EMACS_BIN=/Applications/Emacs.app/Contents/MacOS/bin
    fi
    alias emacs="$EMACS"
    # provides emacsclient
    export PATH=$EMACS_BIN:$PATH
else
    EMACS=$(readlink -f emacs)
fi
</pre>
</div>
</div>
</div>

<div id="outline-container-org108c261" class="outline-2">
<h2 id="org108c261">R</h2>
<div class="outline-text-2" id="text-org108c261">
<p>
I had to give up on installing R with homebrew because it seemed to result in an
interpreter that always wanted to install packages from source. So I used the
arm64 binary from <a href="https://cran.r-project.org/bin/macosx/">https://cran.r-project.org/bin/macosx/</a>
</p>

<p>
For next time: pretty sure <code>=brew install --cask r=</code> is equivalent.
</p>

<p>
Some packages that I know I'll need:
</p>

<div class="org-src-container">
<pre class="src src-sh">R --slave &lt;&lt; EOF
packages &lt;- c("lattice", "RSQLite", "latticeExtra", "argparse", "data.table", "tidyverse")
install.packages(packages, repos="http://cran.fhcrc.org/", dependencies=TRUE, clean=TRUE, Ncpus=4)
EOF
</pre>
</div>

<p>
Wow, this takes a long time!
</p>

<p>
Also:
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install --cask rstudio
</pre>
</div>
</div>
</div>

<div id="outline-container-orge72233d" class="outline-2">
<h2 id="orge72233d">postgresql</h2>
<div class="outline-text-2" id="text-orge72233d">
<p>
Install from <a href="https://postgresapp.com/downloads.html">https://postgresapp.com/downloads.html</a>
</p>

<p>
This installs multiple versions of postgres. My zsh profiile includes the path
to the CLI for the latest version, eg:
</p>

<div class="org-src-container">
<pre class="src src-sh">PATH="/Applications/Postgres.app/Contents/Versions/latest/bin:$PATH"
</pre>
</div>
</div>
</div>
</div>

    <hr>

  </div>
        </div>

        <div class="span3">

            <div class="well" style="padding: 8px 0; background-color: #FBFBFB;">
            <ul class="nav nav-list">
                <li class="nav-header">
                Site
                </li>

                <li><a href="https://nhoffman.github.io/borborygmi/">Archives</a>
                <li><a href="https://nhoffman.github.io/borborygmi/tags.html">Tags</a>
                <li><a href="https://nhoffman.github.io/borborygmi/" rel="alternate">Atom feed</a></li>
            </ul>
            </div>


            <div class="well" style="padding: 8px 0; background-color: #FBFBFB;">
            <ul class="nav nav-list">
                <li class="nav-header">
                Categories
                </li>

                <li><a href="https://nhoffman.github.io/borborygmi/category/lectures.html">lectures</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/notes.html">notes</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/org-mode.html">org-mode</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/projects.html">projects</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/sql.html">sql</a></li>
            </ul>
            </div>


            <div class="well" style="padding: 8px 0; background-color: #FBFBFB;">
            <ul class="nav nav-list">
                <li class="nav-header">
                Links
                </li>

                <li><a href="https://github.com/nhoffman">GitHub account</a></li>
                <li><a href="https://github.com/nhoffman/borborygmi">site source</a></li>
            </ul>
            </div>



        </div>     </div>     </div> 
<footer>
<br />
<p><a href="https://nhoffman.github.io/borborygmi">borborygmi</a> &copy; Noah Hoffman 2024</p>
</footer>

</div> <!-- /container -->


<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-16886766-2', 'auto');
  ga('send', 'pageview');
</script>
</body>
</html>